export const POINTS = [
  { lng: 113.015027,
    lat: 23.12796,
    title: '狮山镇政府充电站' 
  },
  { lng: 112.904555, lat: 23.16992,  title: '广东电网充电站(佛山市三三水区西南街道广海路16号)'},
  { lng: 113.278348, lat: 22.83274,  title: '德顺广场-电动车充电站' },
  { lng: 112.873119, lat: 22.899794, title: '广东电网充电站(佛山市高明区荷城街道大德路足球场)'},
  { lng: 113.242588, lat: 22.85616,  title: '汽车充电站(弘致汽车销售…' },
  { lng: 113.010709, lat: 22.988916, title: '广东电网充电站(佛山市禅…' },
  { lng: 112.99003,  lat: 22.957834, title: '度度充充电站(佛山南海西…' },
  { lng: 112.860238, lat: 22.909341, title: '特来电充电站(高明和泰新…' },
  { lng: 113.040016, lat: 23.015495, title: '汽车充电站(佛汽集团绿岛湖)' },
  { lng: 113.152388, lat: 23.052662, title: '南方电网充电站(佛山南海…' },
  { lng: 113.280736, lat: 22.74766,  title: '特来电充电站(顺德德美化工)' },
  { lng: 113.176781, lat: 23.06615,  title: '特来电充电站(佛山C时代…' },
  { lng: 113.159696, lat: 23.018038, title: '特来电充电站(鹏瑞利广场)' },
  { lng: 113.010314, lat: 23.314631, title: '特来电充电站(威强粉末冶金)' },
  { lng: 113.105905, lat: 23.068371, title: '特来电充电站(佛山匡迪思…' },
  { lng: 113.087713, lat: 22.925765, title: '特来电充电站(佛山顺德华…' },
  { lng: 113.112557, lat: 22.952626, title: '充电站' },
  { lng: 113.091707, lat: 23.01667,  title: '特来电充电站(佛山市中国…' },
  { lng: 113.157771, lat: 23.184849, title: '广东电网充电站(佛山南海..' },
  { lng: 112.925779, lat: 23.366344, title: '广东电网充电站(三水区芦…' },
  { lng: 113.030458, lat: 23.154268, title: '特来电充电站(佛山科技园)' },
  { lng: 113.152403, lat: 23.123224, title: '特斯拉超级充电站(广佛智城站)' },
  { lng: 113.11847,  lat: 23.034956, title: '中研能源充电站(岭南天地P4)' },
  { lng: 113.20558,  lat: 23.146833, title: '国昌红星广场充电站' },
  { lng: 113.109146, lat: 22.921906, title: '特来电充电站(佛山市昌华…' },
  { lng: 113.121162, lat: 23.01869,  title: '特来电充电站(佛山顺联国…' },
  { lng: 113.238082, lat: 22.983959, title: '特来电充电站(佛山顺联机械城)' },
  { lng: 113.051767, lat: 23.066694, title: '特来电充电站(富弘广场)' },
  { lng: 113.070394, lat: 23.01831,  title: '特来电充电站(佛山火炬创…' },
  { lng: 113.068126, lat: 22.96172,  title: '龙凯汽车城充电站' },
  { lng: 113.026673, lat: 22.841829, title: '南方电网充电站(九江中学公共)' },
  { lng: 113.176888, lat: 23.031045, title: '特来电充电站(佛山金百福广场)' },
  { lng: 113.15827,  lat: 23.040063, title: '南方电网充电站(佛山市南…' },
  { lng: 113.129935, lat: 22.984006, title: '粤运公交车充电站(佛山东…' },
  { lng: 113.151257, lat: 23.03605,  title: '特来电充电站(佛山南海区政府)' },
  { lng: 112.9217,   lat: 23.058612, title: '广东电网充电站(佛山南海丹灶镇桂丹' },
  { lng: 113.106821, lat: 23.153009, title: '广东电网充电站(佛山南海狮山镇禅炭路…'},
  { lng: 113.129413,
    lat: 23.016621,
    title: '特来电充电站(佛山印象城6F)' 
  }
];

export const PATTERN = [
  [
    { addIdx: 27, changeIdx: 26 },
    { addIdx: 28, changeIdx: 25 },
    { addIdx: 29, changeIdx: 24 }
  ],
  [
    { addIdx: 30, changeIdx: 23 },
    { addIdx: 31, changeIdx: 22 },
    { addIdx: 32, changeIdx: 21 }
  ],
  [
    { addIdx: 33, changeIdx: 20 },
    { addIdx: 34, changeIdx: 19 },
    { addIdx: 35, changeIdx: 18 }
  ],
  [
    { addIdx: 36, changeIdx: 17 },
    { addIdx: 37, changeIdx: 16 },
    { addIdx: 38, changeIdx: 15 }
  ]
];

export const YEAR = {
  5: 0,
  10: 1,
  15: 2
};

export const YEAR_POINTS_5 = {
  0: [
    {
      title: '可规划充电站-经纬度(113.23421,22.98975)',
      lng: 113.234209,
      lat: 22.98975,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 102,
      p2: 115,
      p3: 95
    },
    {
      title: '可规划充电站-经纬度(113.05177,23.06669)',
      lng: 113.051767,
      lat: 23.066694,
      n1: 11,
      n2: 3,
      n3: 0,
      p1: 98,
      p2: 108,
      p3: 83
    }
  ],
  1: [
    {
      title: '可规划充电站-经纬度(113.23901,22.98610)',
      lng: 113.239006,
      lat: 22.986103,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    },
    {
      title: '可规划充电站-经纬度(113.07039,23.01831)',
      lng: 113.070394,
      lat: 23.01831,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 110,
      p2: 117,
      p3: 95
    },
    {
      title: '可规划充电站-经纬度(113.06813,22.96172)',
      lng: 113.068126,
      lat: 22.96172,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    }
  ],
  2: [
    {
      title:'可规划充电站-经纬度(113.02606,23.13451)',
      lng: 113.026062,
      lat: 23.134518,
      n1: 10,
      n2: 7,
      n3: 2,
      p1: 123,
      p2: 108,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.02667,22.84183)',
      lng: 113.026673,
      lat: 22.841829,
      n1: 15,
      n2: 4,
      n3: 3,
      p1: 119,
      p2: 123,
      p3: 88
    },
    {
      title:'可规划充电站-经纬度(113.17689,23.03105)',
      lng: 113.176888,
      lat: 23.031045,
      n1: 11,
      n2: 2,
      n3: 5,
      p1: 143,
      p2: 107,
      p3: 96
    }
  ],
  3: [
    {
      title:'可规划充电站-经纬度(113.10428,22.86378)',
      lng: 113.104282,
      lat: 22.863783,
      n1: 12,
      n2: 6,
      n3: 3,
      p1: 105,
      p2: 111,
      p3: 93
    },
    {
      title:'可规划充电站-经纬度(113.15827,23.04006)',
      lng: 113.15827,
      lat: 23.040063,
      n1: 11,
      n2: 4,
      n3: 1,
      p1: 107,
      p2: 109,
      p3: 97
    },
    {
      title:'可规划充电站-经纬度(113.12994,22.98401)',
      lng: 113.129935,
      lat: 22.984006,
      n1: 11,
      n2: 2,
      n3: 5,
      p1: 117,
      p2: 108,
      p3: 92
    },
    {
      title:'可规划充电站-经纬度(113.15126,23.0361)',
      lng: 113.151257,
      lat: 23.03605,
      n1: 12,
      n2: 3,
      n3: 4,
      p1: 109,
      p2: 116,
      p3: 91
    }
  ],
  4: [
    {
      title:'可规划充电站-经纬度(113.14589,23.02635)',
      lng: 113.145887,
      lat: 23.02635,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    },
    {
      title:'可规划充电站-经纬度(112.92170,23.05861)',
      lng: 112.9217,
      lat: 23.058612,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 110,
      p2: 117,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.10682,23.15301)',
      lng: 113.106821,
      lat: 23.153009,
      n1: 11,
      n2: 3,
      n3: 0,
      p1: 98,
      p2: 108,
      p3: 83
    }
  ]
};

export const YEAR_POINTS_10 = {
  0: [
    {
      title:'可规划充电站-经纬度(113.12709,23.03376)',
      lng: 113.234209,
      lat: 22.98975,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 102,
      p2: 115,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.05177,23.06669)',
      lng: 113.051767,
      lat: 23.066694,
      n1: 11,
      n2: 3,
      n3: 0,
      p1: 98,
      p2: 108,
      p3: 83
    }
  ],
  1: [
    {
      title:'可规划充电站-经纬度(113.14214,23.02916)',
      lng: 113.239006,
      lat: 22.986103,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    },
    {
      title:'可规划充电站-经纬度(113.07039,23.01831)',
      lng: 113.070394,
      lat: 23.01831,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 110,
      p2: 117,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.06813,22.96172)',
      lng: 113.068126,
      lat: 22.96172,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    }
  ],
  2: [
    {
      title:'可规划充电站-经纬度(113.15214,23.04321)',
      lng: 113.026062,
      lat: 23.134518,
      n1: 10,
      n2: 7,
      n3: 2,
      p1: 123,
      p2: 108,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.02667,22.84183)',
      lng: 113.026673,
      lat: 22.841829,
      n1: 15,
      n2: 4,
      n3: 3,
      p1: 119,
      p2: 123,
      p3: 88
    },
    {
      title:'可规划充电站-经纬度(113.17689,23.03105)',
      lng: 113.176888,
      lat: 23.031045,
      n1: 11,
      n2: 2,
      n3: 5,
      p1: 143,
      p2: 107,
      p3: 96
    }
  ],
  3: [
    {
      title:'可规划充电站-经纬度(113.15610,23.03399)',
      lng: 113.104282,
      lat: 22.863783,
      n1: 12,
      n2: 6,
      n3: 3,
      p1: 105,
      p2: 111,
      p3: 93
    },
    {
      title:'可规划充电站-经纬度(113.15827,23.04006)',
      lng: 113.15827,
      lat: 23.040063,
      n1: 11,
      n2: 4,
      n3: 1,
      p1: 107,
      p2: 109,
      p3: 97
    },
    {
      title:'可规划充电站-经纬度(113.12994,22.98401)',
      lng: 113.129935,
      lat: 22.984006,
      n1: 11,
      n2: 2,
      n3: 5,
      p1: 117,
      p2: 108,
      p3: 92
    },
    {
      title:'可规划充电站-经纬度(113.15126,23.03605)',
      lng: 113.151257,
      lat: 23.03605,
      n1: 12,
      n2: 3,
      n3: 4,
      p1: 109,
      p2: 116,
      p3: 91
    }
  ],
  4: [
    {
      title:'可规划充电站-经纬度(113.13812,23.02642)',
      lng: 113.145887,
      lat: 23.02635,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    },
    {
      title:'可规划充电站-经纬度(112.92170,23.05861)',
      lng: 112.9217,
      lat: 23.058612,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 110,
      p2: 117,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.10682,23.15301)',
      lng: 113.106821,
      lat: 23.153009,
      n1: 11,
      n2: 3,
      n3: 0,
      p1: 98,
      p2: 108,
      p3: 83
    }
  ]
};

export const YEAR_POINTS_15 = {
  0: [
    {
      title:'可规划充电站-经纬度(113.14585,23.02635)',
      lng: 113.234209,
      lat: 22.98975,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 102,
      p2: 115,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.05177,23.06679)',
      lng: 113.051767,
      lat: 23.066694,
      n1: 11,
      n2: 3,
      n3: 0,
      p1: 98,
      p2: 108,
      p3: 83
    }
  ],
  1: [
    {
      title:'可规划充电站-经纬度(113.12416,23.03350)',
      lng: 113.239006,
      lat: 22.986103,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    },
    {
      title:'可规划充电站-经纬度(113.07039,23.01831)',
      lng: 113.070394,
      lat: 23.01831,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 110,
      p2: 117,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.06813,22.96172)',
      lng: 113.068126,
      lat: 22.96172,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    }
  ],
  2: [
    {
      title:'可规划充电站-经纬度(113.12416,23.03350)',
      lng: 113.026062,
      lat: 23.134518,
      n1: 10,
      n2: 7,
      n3: 2,
      p1: 123,
      p2: 108,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.02667,22.84183)',
      lng: 113.026673,
      lat: 22.841829,
      n1: 15,
      n2: 4,
      n3: 3,
      p1: 119,
      p2: 123,
      p3: 88
    },
    {
      title:'可规划充电站-经纬度(113.17689,23.03105)',
      lng: 113.176888,
      lat: 23.031045,
      n1: 11,
      n2: 2,
      n3: 5,
      p1: 143,
      p2: 107,
      p3: 96
    }
  ],
  3: [
    {
      title:'可规划充电站-经纬度(113.11767,22.99980)',
      lng: 113.104282,
      lat: 22.863783,
      n1: 12,
      n2: 6,
      n3: 3,
      p1: 105,
      p2: 111,
      p3: 93
    },
    {
      title:'可规划充电站-经纬度(113.15827,23.04006)',
      lng: 113.15827,
      lat: 23.040063,
      n1: 11,
      n2: 4,
      n3: 1,
      p1: 107,
      p2: 109,
      p3: 97
    },
    {
      title:'可规划充电站-经纬度(113.12994,22.98401)',
      lng: 113.129935,
      lat: 22.984006,
      n1: 11,
      n2: 2,
      n3: 5,
      p1: 117,
      p2: 108,
      p3: 92
    },
    {
      title:'可规划充电站-经纬度(113.15126,23.03605)',
      lng: 113.151257,
      lat: 23.03605,
      n1: 12,
      n2: 3,
      n3: 4,
      p1: 109,
      p2: 116,
      p3: 91
    }
  ],
  4: [
    {
      title:'可规划充电站-经纬度(113.12680,23.05028)',
      lng: 113.145887,
      lat: 23.02635,
      n1: 12,
      n2: 3,
      n3: 1,
      p1: 106,
      p2: 113,
      p3: 90
    },
    {
      title:'可规划充电站-经纬度(112.92170,23.05861)',
      lng: 112.9217,
      lat: 23.058612,
      n1: 13,
      n2: 3,
      n3: 1,
      p1: 110,
      p2: 117,
      p3: 95
    },
    {
      title:'可规划充电站-经纬度(113.10682,23.15301)',
      lng: 113.106821,
      lat: 23.153009,
      n1: 11,
      n2: 3,
      n3: 0,
      p1: 98,
      p2: 108,
      p3: 83
    }
  ]
};
